#define LCDBOTTOMEXT
#include "Include.h"
/*=========================================================================================\n
* @function_name: InitLCD
* @function_file: McuDrive.c
* @描述: 初始化LCD
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-02-27)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void InitLCD(void)
{
//LCD显示，必须配置为禁止输入输出

    P3OE |= 0x0f;           // P3.0~P3.3
    P4OE |= 0xff;           // P4.0~P4.7
    P5OE |= 0xff;           // P5.0~P5.7
    P6OE |= 0xff;           // P6.0~P6.7
    P7OE |= 0x40;           // P7.6

    P3IE &=~ 0x0f;          // P3.0~P3.3
    P4IE &=~ 0xff;          // P4.0~P4.7
    P5IE &=~ 0xff;          // P5.0~P5.7
    P6IE &=~ 0xff;          // P6.0~P6.7
    P7IE &=~ 0x40;          // P7.6 
        
    LCDG=0;
    CtrlLCDV=InitPara38[2];
    LCDCtrl=LCDSETTING6COM;
    SegCtrl0=0x03;
    SegCtrl1=0xff;
    SegCtrl2=0xfC;
    SegCtrl3=0x40;          //SEG24
    SegCtrl4=0xC0;
}
/*=========================================================================================\n
* @function_name: LCDInitSleep
* @function_file: LcdBottom.c
* @描述: 唤醒LCD初始化
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-06-03)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void LCDInitSleep(void)
{
    P3OE |= 0x0f;           // P3.0~P3.3
    P4OE |= 0xff;           // P4.0~P4.7
    P5OE |= 0xff;           // P5.0~P5.7
    P6OE |= 0xff;           // P6.0~P6.7
    P7OE |= 0x40;           // P7.6

    P3IE &=~ 0x0f;          // P3.0~P3.3
    P4IE &=~ 0xff;          // P4.0~P4.7
    P5IE &=~ 0xff;          // P5.0~P5.7
    P6IE &=~ 0xff;          // P6.0~P6.7
    P7IE &=~ 0x40;          // P7.6 

    LCDG=0;
    CtrlLCDV=InitPara38[3];
    LCDCtrl=LCDSETTING6COM;

    SegCtrl0=0x03;
    SegCtrl1=0xff;
    SegCtrl2=0xfC;
    SegCtrl3=0x40;          //SEG24
    SegCtrl4=0xC0;
    
}
/*=========================================================================================\n
* @function_name: LCD_On
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_On(void)
{

}
/*=========================================================================================\n
* @function_name: LCD_Off
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_Off(void)
{
    Disp_Clear();
    SegCtrl0=0;
    SegCtrl1=0;
    SegCtrl2=0;
    SegCtrl3=0;
    SegCtrl4=0;
    DelayXms(5);
    LCDCtrl=0;
    LCDG=1;

}

/*=========================================================================================\n
* @function_name: Disp_Clear
* @function_file: Lcd.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-02-27)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void Disp_Clear(void)
{
    MemSet(guc_LCDRAM, 0,Const_LCDRAMLen);
    LCD_RAMUpdata();
}


/*=========================================================================================\n
* @function_name: Disp_Full
* @function_file: Lcd.c
* @描述: 全屏显示
*
* @参数:
* @返回:
* @作者:   lwb (2012-02-27)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void Disp_Full(void)
{
    MemSet(guc_LCDRAM, 0xff,Const_LCDRAMLen);
    guc_LCDRAM[28]&=~BIT4;
    LCD_RAMUpdata();
}
/*=========================================================================================\n
* @function_name: Dsip_Clr
* @function_file: LcdBottom.c
* @描述: 显示CLR-00
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-06-06)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void Dsip_Clr(void)
{
    MemSet(guc_LCDRAM, 0,Const_LCDRAMLen);
    Disp_Numb(0x00000000,0xAA723100);
    LCD_RAMUpdata();
}
/*=========================================================================================\n
* @function_name: LCD_RAMUpdata
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_RAMUpdata(void)
{
    RefreshLCDRAM(guc_LCDRAM);
}

/*=========================================================================================\n
* @function_name: RefreshLCDRAM
* @function_file: DispPlay.c
* @描述: 把缓存显示数据刷新到LCD RAM中
*
*
* @参数：
* @param: p  缓存首地址，该缓存对应的是SEG2到SEG39，每个SEG对应1个字节
*
* @返回：
* @作者: lim (2011-11-02)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void RefreshLCDRAM(uint8 *p)
{
    uint8 i;
    uint8x  *pLCDM;

    pLCDM=(uint8x*)&LCDM1;

    //seg2 seg6 seg10 seg14 seg18 seg22 seg26 seg30 seg34 seg38
    for(i=0;i<10;i++)
    {
        p[i*4]&=0x3f;
        *(pLCDM+i*3) &=0x0f;
        *(pLCDM+i*3) |=(p[i*4]<<4);
        *(pLCDM+i*3+1)  &=0xfc;
        *(pLCDM+i*3+1)  |=p[i*4]>>4;
    }

    pLCDM=(uint8x*)&LCDM2;
    //seg3 seg7 seg11 seg15 seg19 seg23 seg27 seg31 seg35 seg39
    for(i=0;i<10;i++)
    {
        p[i*4+1]&=0x3f;
        *(pLCDM+i*3)&=0x03;
        *(pLCDM+i*3)|=(p[i*4+1]<<2);
    }


    pLCDM=(uint8x*)&LCDM3;
    //seg4 seg8 seg12 seg16 seg20 seg24 seg28 seg32 seg36
    for(i=0;i<9;i++)
    {
        p[i*4+2]&=0x3f;
        *(pLCDM+i*3)&=0xc0;
        *(pLCDM+i*3)|=p[i*4+2];
    }

    pLCDM=(uint8x*)&LCDM3;
    //seg5 seg9 seg13 seg17 seg21 seg25 seg29 seg33 seg37
    for(i=0;i<9;i++)
    {
        p[i*4+3]&=0x3f;
        *(pLCDM+i*3)&=0x3f;
        *(pLCDM+i*3)|=(p[i*4+3]<<6);

        *(pLCDM+i*3+1)&=0xf0;
        *(pLCDM+i*3+1)|=(p[i*4+3]>>2);
    }
}