#define AP_CORETAB_EXT
#include "Include.h"

/*=========================================================================================\n
* @function_name: FunList
* @function_file: ComCoretab.c
* @描述: 定义特殊处理函数，往这个表里面添加函数只能在末尾添加，请不要在中间添加，否则就乱了
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-05-17)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
const PFUNC code FunList[] = 
{
    //ADK_ReadVar,                    //0x00   阿迪克集抄
    ComReadRunCode,                 //0x01 读取运行状态字
    ReadAccuEgy,                    //0x02 读取周期电量
  //  ReadCurEgy,                     //0x03 读取当前的电量
    ReadHisEgy,                     //0x04 读取历史的电量ReadHisEgy
    ComRWE2Para,                    //0x05 读取E2参数
    ComMeterConst,                  //0x06 读取电表常数 
    ADK_ReadFlash,                      //0x07 读取事件记录次数ComRdEvCnt
    FunToBeDef,                     //0x08 公共假日读写RwGGJR
    FunToBeDef,                     //0x09 读取编程记录（电表清零、开表盖..）ReadJL
    FunToBeDef,                     //0x0A 读写日时段时区等RwSqSd
    FunToBeDef,                     //0x0B 读取冻结数据
    FunToBeDef,                     //0x0C 读写显示项
    RwSysTime,                      //0x0D 读写系统时间
    RwRamE2,                        //0x0E 直接读写E2和Ram
    ADK_Backup,                     //0x0F 读取组合累用电量 ReadZHLYEgy
    ReadVar,                        //0x10 读取表里瞬时值
#ifdef LOADCURVE
    FunToBeDef,                    //0x11 负荷记录ReadCurveJl
#else
    FunToBeDef,                     //0x12 
#endif
    ReadSwVersion,                  //0x13 读取版本号
    FunToBeDef,                 //0x14 读取电量分费率数据块ReadEnyD0Block
    FunToBeDef,                     //0x15 写普通密码WrPassWord
    FunToBeDef,                      //0x16  IrShowLcd
    FunToBeDef,                  //0x17  历史结算时间ReadHisJSTime
    FunToBeDef,                         //0x18  主动上报Report
};
//下面的数据标识必须从小到大排列

/*=========================================================================================\n
 核心表0 主要是电量的数据
===========================================================================================*/
const S_CORETAB code gs_CoreTab0[] = 
{               
//  ID              Atb LEN D1  D0   FUNID   ADDR
    {0x00000000,    0,  4,  0,  0,  0x03,   0,              0,}, //（当前）组合有功总电能
    {0x00010000,    0,  4,  0,  0,  0x03,   0,              0,}, //（当前）正向有功总电能
    {0x00020000,    0,  4,  0,  0,  0x03,   0,              0,}, //（当前）反向有功总电能
};
/*=========================================================================================\n
 核心表1 主要是需量数据
===========================================================================================*/
const S_CORETAB code gs_CoreTab1[] = 
{
//  ID              Atb LEN D1  D0   FUNID   ADDR
    {0x01010000,    0,  4,  0,  0,  0x11,   0,              0,}, //（当前）需量
};  
/*=========================================================================================\n
 核心表2，主要是瞬时值数据
===========================================================================================*/
const S_CORETAB code gs_CoreTab2[] = 
{
//  ID              Atb         LEN D1  D0      FUNID   ADDR
    {0x02010000,  Data_BCD,     2,  0,  0,      0x10,   0,      0,      },//电压数据块查找，数据标识相当于0x0201FF00
    {0x02010100,  Data_BCD,     2,  0,  0,      0x10,   0,      0,      },//A相电压
//  {0x0201FF00,  Data_BCD,     6,  0,  0,      0x10,   0,      1,      },//电压数据块

    {0x02020000,  Data_BCD,     3,  0,  0,      0x10,   0,      2,      },//电流数据块查找，数据标识相当于0x0202FF00
    {0x02020100,  Data_BCD,     3,  0,  0,      0x10,   0,      2,      },//A相电流
//  {0x0202FF00,  Data_BCD,     9,  0,  0,      0x10,   0,      3,      },//电流数据块

    {0x02030000,  Data_BCD,     3,  0,  0,      0x10,   0,      5,      },//瞬时总有功功率
    {0x02030100,  Data_BCD,     3,  0,  0,      0x10,   0,      5,      },//瞬时A相有功功率
    {0x02040000,  Data_BCD,     3,  0,  0,      0x10,   0,      12,      },//瞬时总无功功率
    {0x02040100,  Data_BCD,     3,  0,  0,      0x10,   0,      12,      },//瞬时A相无功功率
//  {0x0203FF00,  Data_BCD,     12, 0,  0,      0x10,   0,      6,      },//功率数据块

    {0x02060000,  Data_BCD,     2,  0,  0,      0x10,   0,      8,      },//总功率因数
    {0x02060100,  Data_BCD,     2,  0,  0,      0x10,   0,      8,      },//A项功率因数
//  {0x0206FF00,  Data_BCD,     8,  0,  0,      0x10,   0,      9,      },//A项功率因数

    {0x02800001,  Data_BCD,     3,  0,  0,      0x10,   0,      4,      },//零线电流
    {0x02800008,  Data_BCD,     2,  0,  0,      0x10,   0,      11,     },//时钟电池电压(内部)
};   
/*******************************************************************************
**核心表4，主要是表计的一些参数
*******************************************************************************/
const S_CORETAB code gs_CoreTab4[] = 
{
    //  ID              Atb                 LEN     D1  D0  FUNID   ADDR
    {0x04000101,    Data_RF,                4,      0,  0,  0x0D,   EEP_DATETIME,           0,      },//日期及星期(其中0代表星期天)
    {0x04000102,    Data_RF,                3,      0,  0,  0x0D,   EEP_DATETIME + 4,       0,      },//时间

    {0x04000401,    0,                      6,      0,  0,  0x05,   EEP_COMADD,             26,     },//通信地址
    {0x04000402,    0,                      6,      0,  0,  0x05,   EEP_METERNO,            12,     },//表号
    //{0x04000403,    0,                      32,     0,  0,  0x05,   EEP_ASSETNO,            0,      },//资产管理编码(ASCII码)
    {0x04000404,    Data_RO,       6,      0,  0,  0x07,   0,            0,      },//额定电压(ASCII码)
    {0x04000405,    Data_RO,       6,      0,  0,  0x07,   0,            0,      },//额定电流/基本电流(ASCII码)
    {0x04000406,    Data_RO,       6,      0,  0,  0x07,   0,            0,      },//最大电流(ASCII码)
    {0x04000409,    Data_RO,       3,      0,  0,  0x07,   0,            0,      },//电表有功常数
    
    {0x04000501,    Data_RO,                1,      0,  6,  0x07,   0,                      0,      },//电表运行状态字1
    {0x04000C01,    Data_WO,                16,     0,  9,  0x14,   EEP_645PASSWD1,         0,      },//0级密码
    {0x04800001,    Data_RO,            32,     0,  0,  0x07,   0,                      0,      },//厂家软件版本号(ASCII码)
    {0x04800002,    Data_RO,            32,     0,  0,  0x07,   0,                      0,      },//厂家硬件版本号(ASCII码)    
};
/*******************************************************************************
**核心表4F，主要是厂内命令
*******************************************************************************/
const   S_CORETAB code gs_CoreTab4F[] = 
{
    //  ID          Atb         LEN D1  D0  FUNID   ADDR
    {0x4F000001,    0,  27, 0,  0,  0x08,   EEP_AUTOCAL,    0,},//自动校表指令
    {0x4F000A00,    0,  8,  0,  0,  0x12,   0,              0,},//读取版本号
    {0x4F010000,    0,  68, 0,  0,  0x0E,   0,              0,},//直接E2读写
};
/*******************************************************************************
**核心表AA，主要是阿迪克命令支持
*******************************************************************************/
const   S_CORETAB code gs_CoreTabAA[] = 
{
    //  ID          Atb         LEN D1  D0  FUNID   ADDR
    {0xAAAAAAAA,    0,  21,  0,  0,  0x00,   0,    0,},//阿迪克扩展集抄
    {0xAAAAAAAB,    0,  16,  0,  0,  0x0F,   0,    0,},//阿迪克扩展电量设底度
};
/*=========================================================================================\n
* @function_name: gs_CoreID
* @function_file: ComCoretab.c
* @描述: 定义核心表与数据ID3的关系
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-05-10)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
const   S_COREID code gs_CoreID[] =       //核心数据表与ID的对应关系
{
    {0x00,  (S_CORETAB code*)gs_CoreTab0, sizeof(gs_CoreTab0) / sizeof(S_CORETAB)},
    {0x01,  (S_CORETAB code*)gs_CoreTab1, sizeof(gs_CoreTab1) / sizeof(S_CORETAB)},
    {0x02,  (S_CORETAB code*)gs_CoreTab2, sizeof(gs_CoreTab2) / sizeof(S_CORETAB)},
    {0x04,  (S_CORETAB code*)gs_CoreTab4, sizeof(gs_CoreTab4) / sizeof(S_CORETAB)},
    {0x4F,  (S_CORETAB code*)gs_CoreTab4F, sizeof(gs_CoreTab4F) / sizeof(S_CORETAB)},
    {0xAA,  (S_CORETAB code*)gs_CoreTabAA, sizeof(gs_CoreTabAA) / sizeof(S_CORETAB)},
};

const   uint8 code NumofCoreID = sizeof(gs_CoreID) / sizeof(S_COREID);

/*=========================================================================================\n
* @function_name: gs_CoreTab97
* @function_file: ComCoretab.c
* @描述: 定义97规约与07规约数据标识映射关系
* 
* @参数: 
* @返回: 
* @作者:   lwb (2016-02-23)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
const   S_CORETAB97 code gs_CoreTab97[] =       //核心数据表与ID的对应关系
{
  //  97ID      07ID  
    {0x9010,  0x00000000,    },     //（当前）正向有功总电能

    {0xAABC,  0xAAAAAAAA,    },     //阿迪克扩展，批量读
    {0xAABD,  0xAAAAAAAB,    },     //阿迪克扩展，设底度值   

    {0xC020,  0x04000501     },//电表运行状态字
    {0xC030,  0x04000409,    },//电表有功常数     
    {0xC032,  0x04000401,    },//通讯地址 
    {0xC034,  0x04000402,    },//表号 
};

const   uint8 code NumofCore97ID = sizeof(gs_CoreTab97) / sizeof(S_CORETAB97);

