#define LCDBOTTOMEXT
#include "Include.h"
#include "PubSet.h"

//char *guc_LCDRAM; 

#define         guc_LCDRAM  RamData.Disp.DispData


void LCD_Init(char *s) 
{
	//guc_LCDRAM = s;
}

/*=========================================================================================\n
* @function_name: InitLCD
* @function_file: McuDrive.c
* @描述: 初始化LCD
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-02-27)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void InitLCD(void)
{
//LCD显示，必须配置为禁止输入输出
//
    P3OE |= 0x0f;
    P4OE |= 0x03;           // P4.0~P4.1
    P5OE |= 0xff;           // P5.0~P5.7
//    P6OE |= 0x0f;           // P6.0~P6.3
    P7OE |= 0x3f;           // P7.0~P7.5
//    P8OE |= 0x04;           // P8.2 
//   P9OE |= 0x01;           // P9.0
    
    P3IE &=~ 0x0f;
    P4IE &=~ 0x03;          // P4.0~P4.1
    P5IE &=~ 0xff;          // P5.0~P5.7
//    P6IE &=~ 0x0f;          // P6.0~P6.3
    P7IE &=~ 0x3f;          // P7.0~P7.5
//    P8IE &=~ 0x04;          // P8.2 
//    P9IE &=~ 0x01;          // P9.0
    
    LCDG      = 0;
    CtrlLCDV  = 0x04;
    LCDCtrl   = 0x92;//LCDSETTING4COM;     //0x82
    SegCtrl0  = 0x00;
    SegCtrl1  = 0xff;
    SegCtrl2  = 0x7C;
    SegCtrl3  = 0x00;
    SegCtrl4  = 0x00;
}
/*=========================================================================================\n
* @function_name: LCDInitSleep
* @function_file: LcdBottom.c
* @描述: 唤醒LCD初始化
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-06-03)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void LCDInitSleep(void)
{
    LCDG=0;
    CtrlLCDV=0x02;
    LCDCtrl=LCDSETTING4COM;

    SegCtrl0  = 0x03;
    SegCtrl1  = 0xff;
    SegCtrl2  = 0x00;
    SegCtrl3  = 0x3f;
    SegCtrl4  = 0x00;
    
}
/*=========================================================================================\n
* @function_name: LCD_On
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_On(void)
{

}
/*=========================================================================================\n
* @function_name: LCD_Off
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_Off(void)
{
    Disp_Clear();
    SegCtrl0=0;
    SegCtrl1=0;
    SegCtrl2=0;
    SegCtrl3=0;
    SegCtrl4=0;
    DelayXms(5);
    LCDCtrl=0;
    LCDG=1;

}

/*=========================================================================================\n
* @function_name: Disp_Clear
* @function_file: Lcd.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-02-27)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void Disp_Clear(void)
{
    MemSet(guc_LCDRAM, 0,Const_LCDRAMLen);
    LCD_RAMUpdata();
}


/*=========================================================================================\n
* @function_name: Disp_Full
* @function_file: Lcd.c
* @描述: 全屏显示
*
* @参数:
* @返回:
* @作者:   lwb (2012-02-27)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void Disp_Full(void)
{
    MemSet(guc_LCDRAM, 0xff,Const_LCDRAMLen);
    LCD_RAMUpdata();
}
/*=========================================================================================\n
* @function_name: Disp_Clr
* @function_file: LcdBottom.c
* @描述: 显示CLR-00
* 
* @参数: 
* @返回: 
* @作者:   lwb (2012-06-06)
* @备注: 
*-------------------------------------------------------------------------------------------
* @修改人:  
* @修改内容: 
===========================================================================================*/
void Disp_Clr(void)
{
    MemSet(guc_LCDRAM, 0,Const_LCDRAMLen);
    //显示版本号低2位数据
    uint32 value;        
    value=(gCuc_VerSoft[6]-0x30)<<12|(gCuc_VerSoft[7]-0x30)<<8
        |(gCuc_VerSoft[9]-0x30)<<4|(gCuc_VerSoft[10]-0x30); 
    Disp_Numb(value, 0x72310000);
    LCD_RAMUpdata();
}
/*=========================================================================================\n
* @function_name: LCD_RAMUpdata
* @function_file: LcdBottom.c
* @描述:
*
* @参数:
* @返回:
* @作者:   lwb (2012-03-15)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void LCD_RAMUpdata(void)
{
    RefreshLCDRAM(guc_LCDRAM);
}

/*=========================================================================================\n
* @function_name: RefreshLCDRAM
* @function_file: DispPlay.c
* @描述: 把缓存显示数据刷新到LCD RAM中
*
*
* @参数：
* @param: p  缓存首地址，该缓存对应的是SEG2到SEG39，每个SEG对应1个字节
*
* @返回：
* @作者: lim (2011-11-02)
* @备注:
*-------------------------------------------------------------------------------------------
* @修改人:
* @修改内容:
===========================================================================================*/
void RefreshLCDRAM(char *p)
{
    uint8x  *pLCDM;
//#define _TestDisp_
      char      i;
    extern char cDispprt;

    pLCDM=(uint8x*)&LCDM0;
    
    #ifdef _TestDisp_

	unsigned char stemp[  _LCDMEnd_ ];

	for (i = 0; i < sizeof(stemp); i++)
          stemp[i] = 0;
        
	stemp[cDispprt / 8] |= 1 << (cDispprt % 8);
        p = stemp;
	
#endif
        

    *(pLCDM+0x06) = p[ _LCDM6_];//2c04-1
    *(pLCDM+0x07) = p[_LCDM7_ ];//2c08-2
    *(pLCDM+0x08) = p[_LCDM8_ ];//2c09-3
    *(pLCDM+0x09)= p[_LCDM9_ ];//2c12-4
    *(pLCDM+0x0a)= p[ _LCDM10_];//2c13-5
    *(pLCDM+0x0B)= p[_LCDM11_ ];//2c14-6
    
    *(pLCDM+0x0d)= p[ _LCDM13_ ];//2c17-7
    *(pLCDM+0x0e)= p[_LCDM14_];//2c17-7
    *(pLCDM+0x0f)= p[_LCDM15_];//2c17-7
    *(pLCDM+0x010)= p[_LCDM16_];//2c17-7
    *(pLCDM+0x011)= p[_LCDM17_];//2c17-7
    
}

 void	UpdateDisp(void)
 {
   RefreshLCDRAM(guc_LCDRAM);
 }
